{
  "cps": {
    "systemName": "Capcom Play System",
    "systemDescription": "The CP System (CPシステム, shīpī shisutemu, CPS for short) is an arcade system board developed by Capcom that ran game software stored on removable daughterboards. More than two dozen arcade titles were released for CPS-1, before Capcom shifted game development over to its successor, the CP System II.\n\nAmong the 33 titles released for the original CP System included Street Fighter II: The World Warrior and its first two follow-ups, Street Fighter II: Champion Edition and Street Fighter II: Hyper Fighting.",
    "systemManufacturer": "Capcom",
    "systemReleaseYear": "1988",
    "systemReleaseDate": "1988-05-13",
    "systemReleaseDateFormated": "May 13, 1988",
    "systemHardwareType": "Arcade",
    "systemCoverSize": "3-4",
    "systemCoverSizeType": "portrait",
    "systemColor": "f1cb47",
    "systemCartSize": "1-1"
  },
  "cps1": {
    "systemName": "CPS-I",
    "systemDescription": "The CP System (CPシステム, shīpī shisutemu, CPS for short) is an arcade system board developed by Capcom that ran game software stored on removable daughterboards. More than two dozen arcade titles were released for CPS-1, before Capcom shifted game development over to its successor, the CP System II.\n\nAmong the 33 titles released for the original CP System included Street Fighter II: The World Warrior and its first two follow-ups, Street Fighter II: Champion Edition and Street Fighter II: Hyper Fighting.",
    "systemManufacturer": "Capcom",
    "systemReleaseYear": "1988",
    "systemReleaseDate": "1988-05-13",
    "systemReleaseDateFormated": "May 13, 1988",
    "systemHardwareType": "Arcade",
    "systemCoverSize": "3-4",
    "systemCoverSizeType": "portrait",
    "systemColor": "f1cb47",
    "systemCartSize": "1-1"
  },
  "cps2": {
    "systemName": "CPS-II",
    "systemDescription": "The CP System II (CPシステムII, shīpī shisutemu tsū) or CPS-2 is an arcade system board that Capcom first used in 1993 for Super Street Fighter II. It was the successor to their previous CP System and Capcom Power System Changer arcade hardware and was succeeded by the CP System III hardware in 1996, of which the CPS-2 would outlive by over four years. The arcade system had new releases for it until the end of 2003, ending with Hyper Street Fighter II.",
    "systemManufacturer": "Capcom",
    "systemReleaseYear": "1993",
    "systemReleaseDate": "1993-09-10",
    "systemReleaseDateFormated": "September 10, 1993",
    "systemHardwareType": "Arcade",
    "systemCoverSize": "3-4",
    "systemCoverSizeType": "portrait",
    "systemColor": "f1cb47",
    "systemCartSize": "1-1"
  },
  "cps3": {
    "systemName": "CPS-III",
    "systemDescription": "The CP System III (CPシステムIII, shīpī shisutemu surī) or CPS-3 is an arcade system board that was first used by Capcom in 1996 with the arcade game Red Earth. It was the second successor to the CP System arcade hardware, following the CP System II. It would be the last proprietary system board Capcom would produce before moving on to the Dreamcast-based Naomi platform.",
    "systemManufacturer": "Capcom",
    "systemReleaseYear": "1996",
    "systemReleaseDate": "1996-11-21",
    "systemReleaseDateFormated": "November 11, 1996",
    "systemHardwareType": "Arcade",
    "systemCoverSize": "3-4",
    "systemCoverSizeType": "portrait",
    "systemColor": "efcb47",
    "systemCartSize": "1-1"
  },
  "famicom": {
    "systemName": "Famicom",
    "systemDescription": "The Nintendo Entertainment System is an 8-bit video game console that was released by Nintendo in North America during 1985, in Europe during 1986 and Australia in 1987. In most of Asia, including Japan (where it was first launched in 1983), China, Vietnam, Singapore, the Middle East and Hong Kong, it was released as the Family Computer, commonly shortened as either the romanized contraction Famicom, or abbreviated to FC. In South Korea, it was known as the Hyundai Comboy, and was distributed by Hynix which then was known as Hyundai Electronics.",
    "systemManufacturer": "Nintendo",
    "systemReleaseYear": "1983",
    "systemReleaseDate": "1983-07-15",
    "systemReleaseDateFormated": "July 15, 1983",
    "systemHardwareType": "Console",
    "systemCoverSize": "3-4",
    "systemCoverSizeType": "portrait",
    "systemColor": "c43d41",
    "systemCartSize": "105-170"
  },
  "fba": {
    "systemName": "FinalBurn Alpha",
    "systemDescription": "This source-available project is based on FinalBurn, created by Dave in 2000. It has been programmed by a team composed of Barry Harris (Old username: TrebleWinner), Jan_Klaassen, KEV, LoopMaster, Mike Haggar, Hyper Yagami and Ayeye.\n\nFinalBurn was one of the first Capcom CPS2 emulators. When this project came to a halt in 2001, its sources were widely disseminated, allowing the development of many unofficial versions, of which FBA is the most successful.\n\nDifferentiated from other emulators by a very large number of supported systems, FB Alpha also offers a clear interface (simple like that of Kawaks) and excellent performance. The icing on the cake; it's not resource-intensive, and you don't need to indulge in complex settings to take it in hand immediately, although its menus are natively in English.",
    "systemManufacturer": "FBA Team",
    "systemReleaseYear": "2000",
    "systemReleaseDate": "2000",
    "systemReleaseDateFormated": "2000",
    "systemHardwareType": "Emulator",
    "systemCoverSize": "3-4",
    "systemCoverSizeType": "portrait",
    "systemColor": "5B60B7",
    "systemCartSize": "1-1"
  },
  "sfc": {
    "systemName": "Super Famicom",
    "systemDescription": "The Super Famicom is a 16-bit home video game console developed by Nintendo that was released in 1990 in Japan, 1991 in North America, 1992 in Europe and Australasia (Oceania), and 1993 in South America.",
    "systemManufacturer": "Nintendo",
    "systemReleaseYear": "1990",
    "systemReleaseDate": "1990-11-21",
    "systemReleaseDateFormated": "November 21, 1990",
    "systemHardwareType": "Console",
    "systemCoverSize": "3-5",
    "systemCoverSizeType": "portrait",
    "systemColor": "3f55a0",
    "systemCartSize": "112-67"
  },
  "megadrive": {
    "systemName": "Mega Drive",
    "systemDescription": "The Mega Drive is a 16-bit fourth-generation home video game console developed and sold by Sega. It's Sega's third console and the successor to the Master System. The Mega Drive was adapted from Sega's System 16 arcade board.",
    "systemManufacturer": "Sega",
    "systemReleaseYear": "1990",
    "systemReleaseDate": "1990",
    "systemReleaseDateFormated": "1990",
    "systemHardwareType": "Console",
    "systemCoverSize": "243-340",
    "systemCoverSizeType": "portrait",
    "systemColor": "0374d1",
    "systemCartSize": "112-67"
  },
  "gamegear": {
    "systemName": "Game Gear",
    "systemDescription": "The Game Gear is an 8-bit fourth generation handheld game console released by Sega on October 6, 1990 in Japan, in April 1991 throughout North America and Europe, and during 1992 in Australia. The Game Gear primarily competed with Nintendo's Game Boy, the Atari Lynx, and NEC's TurboExpress. It shares much of its hardware with the Master System, and can play Master System games by the use of an adapter. Sega positioned the Game Gear, which had a full-color backlit screen with a landscape format, as a technologically superior handheld to the Game Boy.\n\nThough the Game Gear was rushed to market, its unique game library and price point gave it an edge over the Atari Lynx and TurboExpress. However, due to its short battery life, lack of original games, and weak support from Sega, the Game Gear was unable to surpass the Game Boy, selling 10.62 million units by March 1996. The Game Gear was discontinued on April 30, 1997. It was re-released as a budget system by Majesco Entertainment in 2000, under license from Sega.",
    "systemManufacturer": "Sega",
    "systemReleaseYear": "1990",
    "systemReleaseDate": "1990-10-06",
    "systemReleaseDateFormated": "October 6, 1990",
    "systemHardwareType": "Portable",
    "systemCoverSize": "3-4",
    "systemCoverSizeType": "portrait",
    "systemColor": "306db2",
    "systemCartSize": "1-1"
  },
  "genesis": {
    "systemName": "Sega Genesis",
    "systemDescription": "The Sega Genesis, known as the Mega Drive in most regions outside North America, is a 16-bit home video game console which was developed and sold by Sega Enterprises, Ltd. The Genesis was Sega's third console and the successor to the Master System. Sega first released the console as the Mega Drive in Japan in 1988, followed by a North American debut under the Genesis moniker in 1989. In 1990, the console was distributed as the Mega Drive by Virgin Mastertronic in Europe, by Ozisoft in Australasia, and by Tec Toy in Brazil. In South Korea, the systems were distributed by Samsung and were known as the Super Gam*Boy, and later the Super Aladdin Boy. The main microprocessor of the Genesis is a 16/32-bit Motorola 68000 CPU clocked at 7.6 MHz. The console also includes a Zilog Z80 sub-processor, which was mainly used to control the sound hardware and also provides backwards compatibility with the Master System.",
    "systemManufacturer": "Sega",
    "systemReleaseYear": "1989",
    "systemReleaseDate": "1989-08-14",
    "systemReleaseDateFormated": "August 14, 1989",
    "systemHardwareType": "Console",
    "systemCoverSize": "243-340",
    "systemCoverSizeType": "portrait",
    "systemColor": "c23b2c",
    "systemCartSize": "112-67"
  },
  "sega32x": {
    "systemName": "Mega Drive 32X",
    "systemDescription": "The 32X is an add-on for the Sega Mega Drive/Genesis video game console. Codenamed \"Project Mars\", the 32X was designed to expand the power of the Mega Drive/Genesis and serve as a transitional console into the 32-bit era until the release of the Sega Saturn. Independent of the console, the 32X uses its own ROM cartridges and has its own library of games. It was distributed under the name Super 32X in Japan, Genesis 32X in North America, Mega Drive 32X in the PAL region, and Mega 32X in Brazil.\n\nUnveiled by Sega at June 1994's Consumer Electronics Show, the 32X was presented as a low-cost option for consumers looking to play 32-bit games. It was developed in response to the Atari Jaguar and concerns that the Saturn would not make it to market by the end of 1994. Though it was conceived as an entirely new console, at the suggestion of Sega of America executive Joe Miller and his team, it was converted into an add-on for the Genesis and made more powerful. The final design contained two 32-bit central processing units and a 3D graphics processor.",
    "systemManufacturer": "Sega",
    "systemReleaseYear": "1994",
    "systemReleaseDate": "1994-12-03",
    "systemReleaseDateFormated": "December 3, 1994",
    "systemHardwareType": "Peripheral",
    "systemCoverSize": "143-207",
    "systemCoverSizeType": "portrait",
    "systemColor": "0374d1",
    "systemCartSize": "112-67"
  },
  "psx": {
    "systemName": "PlayStation",
    "systemDescription": "The Sony PlayStation, or PS for short, is a fifth generation (1993–2005) home video game console developed and distributed by Sony Interactive Entertainment. It was released on December 3, 1994 in Japan at a retail price of ¥37,000. The console was later released in North America (1995), Europe (1995), Australia (1995), and Korea (1996). The PlayStation was known for standardizing disc based games over cartridges, as well as controllers with two analog sticks and vibration feedback. The console was discontinued on March 23, 2006.\n\nPlayStation (Japanese: プレイステーション, Hepburn: Pureisutēshon, officially abbreviated as PS) is a Japanese video game brand that consists of five home video game consoles, as well as a media center, an online service, a line of controllers, two handhelds and a phone, as well as multiple magazines. The brand is produced by Sony Interactive Entertainment, a division of Sony, with the first console releasing as the PlayStation in Japan released in December 1994, and worldwide the following year.",
    "systemManufacturer": "Sony",
    "systemReleaseYear": "1994",
    "systemReleaseDate": "1994-12-03",
    "systemReleaseDateFormated": "December 3, 1994",
    "systemHardwareType": "Console",
    "systemCoverSize": "1-1",
    "systemCoverSizeType": "square",
    "systemColor": "878b8f",
    "systemCartSize": "1-1"
  },
  "colecovision": {
    "systemName": "ColecoVision",
    "systemDescription": "The ColecoVision is a second generation (1976–1992) home video game console developed and distributed by Coleco Industries. It was released in August 1982 in North America at a retail price of $175. The console was later released in Europe (1983). The ColecoVision offered a closer experience to arcade games than its competitors at the time. The console was discontinued in mid-1985.",
    "systemManufacturer": "Coleco",
    "systemReleaseYear": "1982",
    "systemReleaseDate": "1982-08-01",
    "systemReleaseDateFormated": "August 1, 1982",
    "systemHardwareType": "Console",
    "systemCoverSize": "3-4",
    "systemCoverSizeType": "portrait",
    "systemColor": "e9663e",
    "systemCartSize": "1-1"
  },
  "pc88": {
    "systemName": "PC-88",
    "systemDescription": "The PC-8800 series (Japanese: PC-8800シリーズ, Hepburn: Pī Shī Hassen Happyaku Shirīzu), commonly shortened to PC-88, are a brand of Zilog Z80-based 8-bit home computers released by Nippon Electric Company (NEC) in 1981 and primarily sold in Japan.\n\nThe PC-8800 series sold extremely well and became one of the four major Japanese home computers of the 1980s, along with the Fujitsu FM-7, Sharp X1 and the MSX computers. It was later eclipsed by NEC's 16-bit PC-9800 series, although it still maintained strong sales up until the early 90s.",
    "systemManufacturer": "NEC",
    "systemReleaseYear": "1981",
    "systemReleaseDate": "1981-11",
    "systemReleaseDateFormated": "November 1981",
    "systemHardwareType": "Computer",
    "systemCoverSize": "3-4",
    "systemCoverSizeType": "portrait",
    "systemColor": "3C518B",
    "systemCartSize": "1-1"
  },
  "c64": {
    "systemName": "Commodore 64",
    "systemDescription": "The Commodore 64 is an 8-bit home computer introduced in January 1982 by Commodore International. It is listed in the Guinness World Records as the highest-selling single computer model of all time, with independent estimates placing the number sold between 10 and 17 million units. Volume production started in early 1982, marketing in August for US$595 (equivalent to $1,461 in 2015). Preceded by the Commodore VIC-20 and Commodore PET, the C64 took its name from its 64 kilobytes (65,536 bytes) of RAM. It had superior sound and graphical specifications compared to other earlier systems such as the Apple II and Atari 800, with multi-color sprites and a more advanced sound processor.",
    "systemManufacturer": "Commodore",
    "systemReleaseYear": "1982",
    "systemReleaseDate": "1982-01-01",
    "systemReleaseDateFormated": "January 1, 1982",
    "systemHardwareType": "Computer",
    "systemCoverSize": "3-4",
    "systemCoverSizeType": "portrait",
    "systemColor": "0a58b2",
    "systemCartSize": "1-1"
  },
  "snes": {
    "systemName": "Super Nintendo",
    "systemDescription": "The Super Nintendo Entertainment System (also known as the Super NES, SNES or Super Nintendo) is a 16-bit home video game console developed by Nintendo that was released in 1990 in Japan, 1991 in North America, 1992 in Europe and Australasia (Oceania), and 1993 in South America. In Japan, the system is called the Super Famicom, officially adopting the abbreviated name of its predecessor, the Family Computer, or SFC for short. In South Korea, it is known as the Super Comboy and was distributed by Hyundai Electronics. Although each version is essentially the same, several forms of regional lockout prevent the different versions from being compatible with one another.",
    "systemManufacturer": "Nintendo",
    "systemReleaseYear": "1992",
    "systemReleaseDate": "1992-04-11",
    "systemReleaseDateFormated": "April 11, 1992",
    "systemHardwareType": "Console",
    "systemCoverSize": "4-3",
    "systemCoverSizeType": "landscape",
    "systemColor": "df5142",
    "systemCartSize": "112-67"
  },
  "nes": {
    "systemName": "Nintendo",
    "systemDescription": "The Nintendo Entertainment System is an 8-bit video game console that was released by Nintendo in North America during 1985, in Europe during 1986 and Australia in 1987. In most of Asia, including Japan (where it was first launched in 1983), China, Vietnam, Singapore, the Middle East and Hong Kong, it was released as the Family Computer, commonly shortened as either the romanized contraction Famicom, or abbreviated to FC. In South Korea, it was known as the Hyundai Comboy, and was distributed by Hynix which then was known as Hyundai Electronics.",
    "systemManufacturer": "Nintendo",
    "systemReleaseYear": "1985",
    "systemReleaseDate": "1985-10-18",
    "systemReleaseDateFormated": "October 18, 1985",
    "systemHardwareType": "Console",
    "systemCoverSize": "3-4",
    "systemCoverSizeType": "portrait",
    "systemColor": "c43d41",
    "systemCartSize": "373-436"
  },
  "gba": {
    "systemName": "Game Boy Advance",
    "systemDescription": "The Game Boy Advance (abbreviated as GBA) is a 32-bit handheld video game console developed, manufactured and marketed by Nintendo as the successor to the Game Boy Color. It was released in Japan on March 21, 2001, in North America on June 11, 2001, in Australia and Europe on June 22, 2001, and in mainland China on June 8, 2004 (iQue Player). Nintendo's competitors in the handheld market at the time were the Neo Geo Pocket Color, WonderSwan, GP32, Tapwave Zodiac, and the N-Gage. Despite the competitors' best efforts, Nintendo maintained a majority market share with the Game Boy Advance. As of June 30, 2010, the Game Boy Advance series has sold 81.51 million units worldwide. Its successor, the Nintendo DS, was released in November 2004 and is also compatible with Game Boy Advance software.",
    "systemManufacturer": "Nintendo",
    "systemReleaseYear": "2001",
    "systemReleaseDate": "2001-06-11",
    "systemReleaseDateFormated": "June 11, 2001",
    "systemHardwareType": "Portable",
    "systemCoverSize": "1-1",
    "systemCoverSizeType": "square",
    "systemColor": "4875db",
    "systemCartSize": "112-67"
  },
  "gb": {
    "systemName": "Game Boy",
    "systemDescription": "The Game Boy is an 8-bit handheld video game console developed and manufactured by Nintendo. It was released in Japan on April 21, 1989, in North America in August 1989, and in Europe in 1990. In Southern Asia, it is known as the \"Tata Game Boy\" It is the first handheld console in the Game Boy line. It was created by Gunpei Yokoi and Nintendo's Research and Development — the same staff who had designed the Game & Watch series as well as several popular games for the NES. The Game Boy was Nintendo's second handheld system following the Game & Watch series introduced in 1980, and it combined features from both the Nintendo Entertainment System and Game and Watch. It was also the first handheld game to use video game cartridges since Milton Bradley's Microvision handheld console. It was originally bundled with the puzzle game Tetris. Despite many other, technologically superior handheld consoles introduced during its lifetime, the Game Boy was a tremendous success. The Game Boy and Game Boy Color combined have sold 118.69 million units worldwide. Upon its release in the United States, it sold its entire shipment of one million units within weeks.",
    "systemManufacturer": "Nintendo",
    "systemReleaseYear": "1989",
    "systemReleaseDate": "1989-04-21",
    "systemReleaseDateFormated": "April 21, 1989",
    "systemHardwareType": "Portable",
    "systemCoverSize": "1-1",
    "systemCoverSizeType": "square",
    "systemColor": "3c528d",
    "systemCartSize": "373-436"
  },
  "gbc": {
    "systemName": "Game Boy Color",
    "systemDescription": "The Game Boy Color, (abbreviated as GBC) is a handheld game console manufactured by Nintendo, which was released on October 21, 1998 in Japan and was released in November of the same year in international markets. It is the successor of the Game Boy. The Game Boy Color, as suggested by the name, features a color screen, but no backlight. It is slightly thicker and taller than the Game Boy Pocket, which is a redesigned Game Boy released in 1996. As with the original Game Boy, it has a custom 8-bit processor somewhat related to a Zilog Z80 central processing unit (CPU). The original name - with its American English spelling of \"color\" - remained unchanged even in markets where \"colour\" was the accepted English spelling. The Game Boy Color's primary competitors were the much more advanced Neo Geo Pocket by SNK and the WonderSwan by Bandai (both released in Japan only), though the Game Boy Color outsold these by a wide margin. The Game Boy and Game Boy Color combined have sold 118.69 million units worldwide. It was discontinued in 2003, shortly after the release of the Game Boy Advance SP.",
    "systemManufacturer": "Nintendo",
    "systemReleaseYear": "1998",
    "systemReleaseDate": "1998-10-21",
    "systemReleaseDateFormated": "October 21, 1998",
    "systemHardwareType": "Portable",
    "systemCoverSize": "1-1",
    "systemCoverSizeType": "square",
    "systemColor": "fbb625",
    "systemCartSize": "373-436"
  },
  "neogeo": {
    "systemName": "Neo Geo",
    "systemDescription": "The Advanced Entertainment System (AES), originally known just as the Neo Geo, is the first video game console in the family. The hardware features comparatively colorful 2D graphics. The hardware was in part designed by Alpha Denshi (later ADK). Initially, the home system was only available for rent to commercial establishments, such as hotel chains, bars and restaurants, and other venues. When customer response indicated that some gamers were willing to buy a US$650 console, SNK expanded sales and marketing into the home console market. The Neo Geo console was officially launched on 31 January 1990 in Osaka, Japan. The AES is identical to its arcade counterpart, the MVS, so arcade games released for the home market are nearly identical conversions.",
    "systemManufacturer": "SNK",
    "systemReleaseYear": "1990",
    "systemReleaseDate": "1990-01-31",
    "systemReleaseDateFormated": "January 31, 1990",
    "systemHardwareType": "Console",
    "systemCoverSize": "3-4",
    "systemCoverSizeType": "portrait",
    "systemColor": "7c818c",
    "systemCartSize": "4-3"
  },
  "atarilynx": {
    "systemName": "Atari Lynx",
    "systemDescription": "The Atari Lynx, usually just referred to as Lynx, is a fourth generation (1987-2004) handheld video game console developed in partnership with Epyx, Inc. and distributed by the Atari Corporation. It was released in September 1989 in North America at a retail price of $149.95. The handheld was also released in Europe (1990) and Japan (1990). The Lynx was the world's first handheld electronic game with a color LCD screen. The console was discontinued in early 1996, possibly at the time of the company's sale on April 8, 1996.",
    "systemManufacturer": "Atari",
    "systemReleaseYear": "1989",
    "systemReleaseDate": "1989-09-01",
    "systemReleaseDateFormated": "September 1, 1989",
    "systemHardwareType": "Portable",
    "systemCoverSize": "3-4",
    "systemCoverSizeType": "portrait",
    "systemColor": "ea9830",
    "systemCartSize": "1-1"
  },
  "ngp": {
    "systemName": "Neo Geo Pocket",
    "systemDescription": "The Neo Geo Pocket is a monochrome handheld game console released by SNK. It was the company's first handheld system and is part of the Neo Geo family. It debuted in Japan in late 1998 but never saw an American release, being exclusive to Japan, Asia and Europe.\n\nThe Neo Geo Pocket is considered to be an unsuccessful console. Lower than expected sales resulted in its discontinuation in 1999, and was immediately succeeded by the Neo Geo Pocket Color, a full color device allowing the system to compete more easily with the dominant Game Boy Color handheld, and which also saw an American release. Though the system enjoyed only a short life, there were some significant games released on the system such as Samurai Shodown, and King of Fighters R-1.",
    "systemManufacturer": "SNK",
    "systemReleaseYear": "1998",
    "systemReleaseDate": "1998-12-31",
    "systemReleaseDateFormated": "December 31, 1998",
    "systemHardwareType": "Portable",
    "systemCoverSize": "373-436",
    "systemCoverSizeType": "square",
    "systemColor": "f4a141",
    "systemCartSize": "257-229"
  },
  "pcengine": {
    "systemName": "PC Engine",
    "systemDescription": "The PC Engine is a 16-bit fourth-generation home video game console designed by Hudson Soft and sold by NEC Home Electronics. It was released in Japan in 1987 and in North America in 1989. The Japanese model was imported and distributed in France in 1989, and the United Kingdom and Spain received a version based on the American model known as simply TurboGrafx. It was the first console released in the 16-bit era, although it used a modified 8-bit CPU. In Japan, the system was launched as a competitor to the Famicom, but the delayed United States release meant that it ended up competing with the Sega Genesis and later the Super Nintendo Entertainment System.\n\nThe PC Engine has an 8-bit CPU, a 16-bit video color encoder, and a 16-bit video display controller. The GPUs are capable of displaying 482 colors simultaneously, out of 512. With dimensions of just 14 cm × 14 cm × 3.8 cm (5.5 in × 5.5 in × 1.5 in), the Japanese PC Engine is the smallest major home game console ever made. Games were released on HuCard cartridges and later the CD-ROM optical format.",
    "systemManufacturer": "NEC",
    "systemReleaseYear": "1987",
    "systemReleaseDate": "1987-10-30",
    "systemReleaseDateFormated": "October 30, 1987",
    "systemHardwareType": "Console",
    "systemCoverSize": "1-1",
    "systemCoverSizeType": "square",
    "systemColor": "c64c3f",
    "systemCartSize": "3-5"
  },
  "virtualboy": {
    "systemName": "Virtual Boy",
    "systemDescription": "The Virtual Boy is a 32-bit tabletop portable video game console developed and manufactured by Nintendo. Released in 1995, it was marketed as the first console capable of displaying stereoscopic \"3D\" graphics. The player uses the console like a head-mounted display, placing the head against the eyepiece to see a red monochrome display.\n\nThe games use a parallax effect to create the illusion of depth. Sales failed to meet targets, and Nintendo ceased distribution and game development in 1996, having released only 22 games for the system.",
    "systemManufacturer": "Nintendo",
    "systemReleaseYear": "1995",
    "systemReleaseDate": "1995-07-21",
    "systemReleaseDateFormated": "July 21, 1995",
    "systemHardwareType": "Portable",
    "systemCoverSize": "1-1",
    "systemCoverSizeType": "square",
    "systemColor": "f05148",
    "systemCartSize": "257-229"
  },
  "wonderswan": {
    "systemName": "WonderSwan",
    "systemDescription": "The WonderSwan is a handheld game console released in Japan by Bandai. It was developed by Gunpei Yokoi's company Koto Laboratory and Bandai, and was the last piece of hardware Yokoi developed before his death in 1997.\n\nReleased in 1999 in the fifth generation of video game consoles, the WonderSwan and its two later models, the WonderSwan Color and SwanCrystal were officially supported until being discontinued by Bandai in 2003. During its lifespan, no variation of the WonderSwan was released outside of Japan.",
    "systemManufacturer": "Bandai",
    "systemReleaseYear": "1999",
    "systemReleaseDate": "1999-03-04",
    "systemReleaseDateFormated": "March 4, 1999",
    "systemHardwareType": "Portable",
    "systemCoverSize": "5-7",
    "systemCoverSizeType": "portrait",
    "systemColor": "72c4bf",
    "systemCartSize": "112-67"
  },
  "mame": {
    "systemName": "MAME",
    "systemDescription": "MAME (formerly an acronym of Multiple Arcade Machine Emulator) is a free and open-source emulator designed to recreate the hardware of arcade game systems in software on modern personal computers and other platforms. Its intention is to preserve gaming history by preventing vintage games from being lost or forgotten. It does this by emulating the inner workings of the emulated arcade machines; the ability to actually play the games is considered \"a nice side effect\". Joystiq has listed MAME as an application that every Windows and Mac gamer should have.\n\nThe first public MAME release was by Nicola Salmoria on 5 February 1997. It now supports over 7,000 unique games and 10,000 actual ROM image sets, though not all of the games are playable. MESS, an emulator for many video game consoles and computer systems, based on the MAME core, was integrated into MAME in 2015.",
    "systemManufacturer": "MAME Team",
    "systemReleaseYear": "1997",
    "systemReleaseDate": "1997-02-05",
    "systemReleaseDateFormated": "February 5, 1997",
    "systemHardwareType": "Emulator",
    "systemCoverSize": "3-4",
    "systemCoverSizeType": "portrait",
    "systemColor": "5a64bb",
    "systemCartSize": "1-1"
  },
  "arcade": {
    "systemName": "Arcade",
    "systemDescription": "An arcade game or coin-op is a coin-operated entertainment machine typically installed in public businesses such as restaurants, bars and amusement arcades. Most arcade games are video games, pinball machines, electro-mechanical games, redemption games or merchandisers. While exact dates are debated, the golden age of arcade video games is usually defined as a period beginning sometime in the late 1970s and ending sometime in the mid-1980s. Excluding a brief resurgence in the early 1990s, the arcade industry subsequently declined in the Western hemisphere as competing home-based video game consoles such as Playstation and Xbox increased in their graphics and game-play capability and decreased in cost.",
    "systemManufacturer": "Various",
    "systemReleaseYear": "Various",
    "systemReleaseDate": "Various",
    "systemReleaseDateFormated": "Various",
    "systemHardwareType": "Collection",
    "systemCoverSize": "3-4",
    "systemCoverSizeType": "portrait",
    "systemColor": "5a64bb",
    "systemCartSize": "1-1"
  },
  "dos": {
    "systemName": "MS-DOS",
    "systemDescription": "MS-DOS, short for Microsoft Disk Operating System, was an operating system for x86-based personal computers mostly developed by Microsoft. It was the most commonly used member of the DOS family of operating systems, and was the main operating system for IBM PC compatible personal computers during the 1980s to the mid-1990s, when it was gradually superseded by operating systems offering a graphical user interface (GUI), in various generations of the Microsoft Windows operating system.",
    "systemManufacturer": "Microsoft",
    "systemReleaseYear": "1981",
    "systemReleaseDate": "1981-08-01",
    "systemReleaseDateFormated": "August 1, 1981",
    "systemHardwareType": "OS",
    "systemCoverSize": "3-4",
    "systemCoverSizeType": "portrait",
    "systemColor": "2d61c1",
    "systemCartSize": "1-1"
  },
  "arduboy": {
    "systemName": "Arduboy",
    "systemDescription": "The Arduboy is a handheld game console with open source software, based on the Arduino hardware platform.",
    "systemManufacturer": "Kevin Bates",
    "systemReleaseYear": "2015",
    "systemReleaseDate": "2015",
    "systemReleaseDateFormated": "2015",
    "systemHardwareType": "Portable",
    "systemCoverSize": "1-1",
    "systemCoverSizeType": "square",
    "systemColor": "5F459C",
    "systemCartSize": "1-1"
  },
  "chailove": {
    "systemName": "ChaiLove Framework",
    "systemDescription": "ChaiLove is an awesome framework you can use to make 2D games in ChaiScript. It's free, open-source, and works on Windows, Mac OS X, Linux, Android, and ARM through libretro/RetroArch.",
    "systemManufacturer": "ChaiLove Team",
    "systemReleaseYear": "2017",
    "systemReleaseDate": "2017-11-30",
    "systemReleaseDateFormated": "November 30, 2017",
    "systemHardwareType": "Engine",
    "systemCoverSize": "1-1",
    "systemCoverSizeType": "square",
    "systemColor": "26AAE0",
    "systemCartSize": "1-1"
  },
  "gameandwatch": {
    "systemName": "Game & Watch",
    "systemDescription": "The Game & Watch brand is a series of handheld electronic games developed, manufactured, released and marketed by Nintendo from 1980 to 1991. Created by game designer Gunpei Yokoi, the product derived its name from its featuring a single game as well as a clock on a LCD screen. The models from 1981 onwards featured an alarm in addition. It was the earliest Nintendo video game product to gain major success.\n\nThe units are based on a 4-bit CPU, from the Sharp SM5xx family, that include a small ROM and RAM area and an LCD screen driver circuit, although, prior to its simulation in MAME, there was a misconception in that every unit used a custom ASIC instead of a proper microcontroller.\n\nThe series sold a combined of 43.4 million units worldwide.",
    "systemManufacturer": "Nintendo",
    "systemReleaseYear": "1980",
    "systemReleaseDate": "1980-04-28",
    "systemReleaseDateFormated": "April 28, 1980",
    "systemHardwareType": "Portable",
    "systemCoverSize": "112-67",
    "systemCoverSizeType": "landscape",
    "systemColor": "8ca3ae",
    "systemCartSize": "1-1"
  },
  "lowresnx": {
    "systemName": "LowRes NX",
    "systemDescription": "LowRes NX was inspired by real 8-bit and 16-bit systems and simulates chips for graphics, sound and I/O, which actually work like classic hardware. It supports hardware sprites as well as hardware parallax scrolling, and even offers vertical blank and raster interrupts to create authentic retro effects.  Imagine LowRes NX as a handheld game console with a d-pad, two action buttons and a little rubber keyboard below a slidable touchscreen.",
    "systemManufacturer": "Timo Kloss",
    "systemReleaseYear": "2017",
    "systemReleaseDate": "2017",
    "systemReleaseDateFormated": "2017",
    "systemHardwareType": "Engine",
    "systemCoverSize": "1-1",
    "systemCoverSizeType": "square",
    "systemColor": "00AAAA",
    "systemCartSize": "1-1"
  },
  "lutro": {
    "systemName": "Lutro",
    "systemDescription": "Lutro is a 2D game framework that aims for simplicity and extreme portability. Using lutro, you can develop any kind of 2D retro games, like NES or Genesis games, and run them on a wide range of platforms through RetroArch. Lutro makes it easy to write games by using Lua and following the LÖVE API. Portability is achieved through the libretro API: Lutro is just loaded as a plugin in a frontend like RetroArch which takes care of display, audio and inputs.",
    "systemManufacturer": "libretro",
    "systemReleaseYear": "2015",
    "systemReleaseDate": "2015-02-15",
    "systemReleaseDateFormated": "February 17, 2015",
    "systemHardwareType": "Engine",
    "systemCoverSize": "1-1",
    "systemCoverSizeType": "square",
    "systemColor": "926183",
    "systemCartSize": "1-1"
  },
  "macintosh": {
    "systemName": "Macintosh",
    "systemDescription": "The Macintosh (mainly Mac since 1998) is a family of personal computers designed, manufactured, and sold by Apple Inc. (originally as Apple Computer, Inc.) since January 1984.\n\nThe original Macintosh is the first successful mass-market all-in-one desktop personal computer to have featured a graphical user interface, built-in screen, and mouse. Apple sold the Macintosh alongside its popular Apple II, Apple IIGS, Apple III, and Apple Lisa families of computers until the other models were discontinued in the 1990s.",
    "systemManufacturer": "Apple",
    "systemReleaseYear": "1984",
    "systemReleaseDate": "1984-01",
    "systemReleaseDateFormated": "January 1984",
    "systemHardwareType": "Computer",
    "systemCoverSize": "3-4",
    "systemCoverSizeType": "portrait",
    "systemColor": "12a3df",
    "systemCartSize": "1-1"
  },
  "palm": {
    "systemName": "Palm",
    "systemDescription": "The PalmPilot Personal and PalmPilot Professional are the second generation of Palm PDA devices produced by Palm Inc (then a subsidiary of U.S. Robotics, later 3Com). These devices were launched on March 10, 1997",
    "systemManufacturer": "Palm Inc",
    "systemReleaseYear": "1997",
    "systemReleaseDate": "1997-03-10",
    "systemReleaseDateFormated": "March 10, 1997",
    "systemHardwareType": "OS",
    "systemCoverSize": "1-1",
    "systemCoverSizeType": "square",
    "systemColor": "324A42",
    "systemCartSize": "1-1"
  },
  "3do": {
    "systemName": "3DO",
    "systemDescription": "The 3DO Interactive Multiplayer (often called simply 3DO) is a video game console originally produced by Panasonic in 1993. Further renditions of the hardware were released in 1994 by Sanyo and Goldstar. The consoles were manufactured according to specifications created by The 3DO Company, and were originally designed by Dave Needle and RJ Mical of New Technology Group. The system was conceived by entrepreneur and Electronic Arts founder Trip Hawkins.",
    "systemManufacturer": "Panasonic",
    "systemReleaseYear": "1993",
    "systemReleaseDate": "1993-10-04",
    "systemReleaseDateFormated": "October 4, 1993",
    "systemHardwareType": "Console",
    "systemCoverSize": "752-1440",
    "systemCoverSizeType": "portrait",
    "systemColor": "d4a53a",
    "systemCartSize": "1-1"
  },
  "doom": {
    "systemName": "Doom",
    "systemDescription": "Doom is a 1993 first-person shooter (FPS) game developed by id Software for MS-DOS. Players assume the role of a space marine, popularly known as Doomguy, fighting their way through hordes of invading demons from hell. Id began developing Doom after the release of their previous FPS, Wolfenstein 3D (1992).",
    "systemManufacturer": "id Software",
    "systemReleaseYear": "1993",
    "systemReleaseDate": "1993-12-10",
    "systemReleaseDateFormated": "December 10, 1993",
    "systemHardwareType": "Engine",
    "systemCoverSize": "1-1",
    "systemCoverSizeType": "square",
    "systemColor": "A11321",
    "systemCartSize": "1-1"
  },
  "pico8": {
    "systemName": "PICO-8",
    "systemDescription": "PICO-8 is a virtual machine and game engine created by Lexaloffle Games. It is a fantasy video game console that mimics the limited graphical and sound capabilities of 8-bit systems of the 1980s.",
    "systemManufacturer": "Lexaloffle",
    "systemReleaseYear": "2015",
    "systemReleaseDate": "2015-04",
    "systemReleaseDateFormated": "April 2015",
    "systemHardwareType": "Engine",
    "systemCoverSize": "3-4",
    "systemCoverSizeType": "portrait",
    "systemColor": "24192C",
    "systemCartSize": "373-436"
  },
  "scummvm": {
    "systemName": "ScummVM",
    "systemDescription": "Script Creation Utility for Maniac Mansion Virtual Machine (ScummVM) is a set of game engine recreations. Originally designed to play LucasArts adventure games that use the SCUMM system, it also supports a variety of non-SCUMM games by companies like Revolution Software and Adventure Soft. It was originally written by Ludvig Strigeus. Released under the terms of the GNU General Public License, ScummVM is free software. ScummVM is a reimplementation of the part of the software used to interpret the scripting languages such games used to describe the game world rather than emulating the hardware the games ran on; as such, ScummVM allows the games it supports to be played on platforms other than those for which they were originally released.",
    "systemManufacturer": "ScummVM",
    "systemReleaseYear": "2001",
    "systemReleaseDate": "2001-10-05",
    "systemReleaseDateFormated": "October 5, 2001",
    "systemHardwareType": "Engine",
    "systemCoverSize": "3-4",
    "systemCoverSizeType": "portrait",
    "systemColor": "4cac54",
    "systemCartSize": "1-1"
  },
  "j2me": {
    "systemName": "J2ME",
    "systemDescription": "Java Platform, Micro Edition or Java ME is a computing platform for development and deployment of portable code for embedded and mobile devices (micro-controllers, sensors, gateways, mobile phones, personal digital assistants, TV set-top boxes, printers). Java ME was formerly known as Java 2 Platform, Micro Edition or J2ME. As of December 22, 2006, the Java ME source code is licensed under the GNU General Public License, and is released under the project name phoneME.",
    "systemManufacturer": "Oracle",
    "systemReleaseYear": "1998",
    "systemReleaseDate": "1998-12-08",
    "systemReleaseDateFormated": "December 8, 1998",
    "systemHardwareType": "OS",
    "systemCoverSize": "1-1",
    "systemCoverSizeType": "square",
    "systemColor": "F8981D",
    "systemCartSize": "1-1"
  },
  "tic80": {
    "systemName": "TIC-80",
    "systemDescription": "TIC-80 is a free and open source fantasy computer for making, playing and sharing tiny games. There are built-in tools for development: code, sprites, maps, sound editors and the command line, which is enough to create a mini retro game. At the exit you will get a cartridge file, which can be stored and played on the website. Also, the game can be packed into a player that works on all popular platforms and distribute as you wish. To make a retro styled game the whole process of creation takes place under some technical limitations: 240x136 pixels display, 16 color palette, 256 8x8 color sprites, 4 channel sound and etc.",
    "systemManufacturer": "Vadim Grigoruk",
    "systemReleaseYear": "2017",
    "systemReleaseDate": "2017",
    "systemReleaseDateFormated": "2017",
    "systemHardwareType": "Engine",
    "systemCoverSize": "1-1",
    "systemCoverSizeType": "square",
    "systemColor": "140C1C",
    "systemCartSize": "1-1"
  },
  "quake": {
    "systemName": "Quake",
    "systemDescription": "Quake is a first-person shooter game developed by id Software and published by GT Interactive. The first game in the Quake series, it was originally released for MS-DOS, Microsoft Windows and Linux in 1996, followed by Mac OS and Sega Saturn in 1997 and Nintendo 64 in 1998. In the game, players must find their way through various maze-like, medieval environments while battling monsters using an array of weaponry. The overall atmosphere is dark and gritty, with many stone textures and a rusty, capitalized font. Quake takes inspiration from gothic fiction and the works of H. P. Lovecraft.",
    "systemManufacturer": "id Software",
    "systemReleaseYear": "1996",
    "systemReleaseDate": "1996-06-22",
    "systemReleaseDateFormated": "June 22, 1996",
    "systemHardwareType": "Engine",
    "systemCoverSize": "3-4",
    "systemCoverSizeType": "portrait",
    "systemColor": "B32E34",
    "systemCartSize": "1-1"
  },
  "uzebox": {
    "systemName": "Uzebox",
    "systemDescription": "The Uzebox is a retro-minimalist 8-bit open source game console. It is based on an AVR 8-bit general purpose microcontroller made by Atmel. The particularity of the system is that it uses an interrupt driven kernel and has no frame buffer. Functions such as video signal generation, tile rendering and music mixing is done in realtime by a background task so your game can easily be developed in C.\n\n   The design goal was to be as simple as possible yet have good enough sound and graphics to implement interesting games. Emphasis was put on making it easy and fun to assemble and program for any hobbyists. The final design contains only two chips: an ATmega644 and an AD725 RGB-to-NTSC converter.",
    "systemManufacturer": "Belogic",
    "systemReleaseYear": "2008",
    "systemReleaseDate": "2008-08-24",
    "systemReleaseDateFormated": "August 24, 2008",
    "systemHardwareType": "Console",
    "systemCoverSize": "3-4",
    "systemCoverSizeType": "portrait",
    "systemColor": "CE3D3D",
    "systemCartSize": "1-1"
  },
  "vectrex": {
    "systemName": "Vectrex",
    "systemDescription": "The Vectrex is a vector display-based home video game console–the only one ever designed and released for the home market, developed by Smith Engineering. It was first released for the North America market in November 1982 and then Europe and Japan in 1983. Originally manufactured by General Consumer Electronics, it was later licensed to Milton Bradley after they acquired the company. Bandai released the system in Japan.\n\nThe Vectrex, in contrast to other video-game systems available at the time, featured an integrated monochrome CRT monitor and did not need to be hooked up to a television set as it provided its own built-in display. A detachable wired control pad was mounted at, and could be folded into, the lower base of the console. Games included translucent color sheet overlays that could be placed over the monochrome screen. A number of peripherals were produced, such as a pair of 3D goggles known as the \"3D Imager\" and a \"light-pen\" that allowed the player to draw directly on the screen. A built-in game, Mine Storm, was playable without inserting a cartridge.",
    "systemManufacturer": "Smith Eng.",
    "systemReleaseYear": "1982",
    "systemReleaseDate": "1982-11",
    "systemReleaseDateFormated": "November 1982",
    "systemHardwareType": "Console",
    "systemCoverSize": "3-4",
    "systemCoverSizeType": "portrait",
    "systemColor": "4794dc",
    "systemCartSize": "1-1"
  },
  "wasm4": {
    "systemName": "WASM-4",
    "systemDescription": "WASM-4 is a low-level fantasy game console for building small games with WebAssembly. Game cartridges (ROMs) are small, self-contained .wasm files that can be built with any programming language that compiles to WebAssembly.",
    "systemManufacturer": "Bruno Garcia",
    "systemReleaseYear": "2022",
    "systemReleaseDate": "2022-06-21",
    "systemReleaseDateFormated": "June 21, 2022",
    "systemHardwareType": "Engine",
    "systemCoverSize": "1-1",
    "systemCoverSizeType": "square",
    "systemColor": "3A4E25",
    "systemCartSize": "1-1"
  },
  "x1": {
    "systemName": "X1",
    "systemDescription": "The X1 (エックスワン, Ekkusuwan), sometimes called the Sharp X1, is a series of home computers released by Sharp Corporation from 1982 to 1988. It was based on a Z80 CPU.\n\nDespite the fact that the Computer Division of Sharp Corporation had released the MZ series, suddenly the Television Division released a new computer series called the X1. At the time the original X1 was released, all other home computers generally had a BASIC language in ROM. However the X1 did not have a BASIC ROM, and it had to load the Hu-BASIC interpreter from a cassette tape. On the plus side however, this concept meant that a free RAM area was available that was as big as possible when not using BASIC. This policy was originally copied from the Sharp MZ series, and they were called clean computers in Japan. The cabinet shape of X1 was also much more stylish than others at that time and a range of cabinet colors (including Red) was selectable.\n\nThe RGB display monitor for the X1 had a television tuner, and a computer screen could be super-imposed on TV. All the TV functions could be controlled from a computer program. The character font was completely programmable (A.K.A. PCG) with 4bit color, and was effectively used in many games. The entirety of the VRAM memory was mapped on to the I/O area, so it was controlled without bank switching. Since X1 had these features, it was very powerful for game software.\n\nWhile X1 was struggling to sell, the PC8801 (from NEC) was quickly becoming popular in the Japanese market. In 1984, Sharp released the X1 turbo series with high resolution graphics (640x400, while X1 had 640x200). It had many improvements, but the clock speed was still only 4 MHz. In 1986, Sharp released the X1 turbo Z series with a 4096 color analog RGB monitor. An X1 twin, which had a PC-Engine in the cabinet, was finally released as the last machine of the X1 series in 1987. Then this series was succeeded by the X68000 series.\n\nSharp continues to sell desktop PC/TV combos in Japan through its Internet Aquos line, where an X1-style red color scheme is available.",
    "systemManufacturer": "Sharp",
    "systemReleaseYear": "1982",
    "systemReleaseDate": "1982",
    "systemReleaseDateFormated": "1982",
    "systemHardwareType": "Computer",
    "systemCoverSize": "3-4",
    "systemCoverSizeType": "portrait",
    "systemColor": "c2433a",
    "systemCartSize": "1-1"
  }
}